#### Terraform fmt `success`, init `success`, plan `success`
<details><summary>Show Plan</summary>

```
terraform
ec_deployment.onweek_demo: Refreshing state... [id=b182e085c8da8da5f11de1a58a9d404e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lightsail_instance.onweek_windows_test_1 will be created
  + resource "aws_lightsail_instance" "onweek_windows_test_1" {
      + arn                = (known after apply)
      + availability_zone  = "us-east-1a"
      + blueprint_id       = "windows_server_2019"
      + bundle_id          = "micro_win_2_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + name               = "onweek_windows_test_1"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + user_data          = <<-EOT
            <powershell>
            $ProgressPreference = 'SilentlyContinue'
            Set-PSDebug -Trace 1
            Set-Location -Path "C:\Users\Administrator\Desktop"
            
            Invoke-WebRequest -Uri "https://artifacts.elastic.co/downloads/beats/elastic-agent/elastic-agent-7.12.1-windows-x86_64.zip" -OutFile "agent.zip"
            Expand-Archive -Path "agent.zip" -DestinationPath "C:\Users\Administrator\Desktop\agent"
            
            Start-Sleep -Seconds 10
            
            Add-MpPreference -ExclusionPath "C:\Users\Administrators\Desktop"
            Invoke-WebRequest -Uri "https://github.com/gentilkiwi/mimikatz/releases/download/2.2.0-20200918-fix/mimikatz_trunk.zip" -OutFile "mimikatz_trunk.zip"
            Expand-Archive -Path "mimikatz_trunk.zip" -DestinationPath "C:\Users\Administrator\Desktop\mimikatz"
            </powershell>
        EOT
      + username           = (known after apply)
    }

  # aws_lightsail_instance_public_ports.onweek_test will be created
  + resource "aws_lightsail_instance_public_ports" "onweek_test" {
      + id            = (known after apply)
      + instance_name = "onweek_windows_test_1"

      + port_info {
          + cidrs     = (known after apply)
          + from_port = 3389
          + protocol  = "tcp"
          + to_port   = 3389
        }
    }

  # aws_lightsail_static_ip.onweek_windows_test_ip_1 will be created
  + resource "aws_lightsail_static_ip" "onweek_windows_test_ip_1" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + ip_address   = (known after apply)
      + name         = "onweek_windows_test_ip_1"
      + support_code = (known after apply)
    }

  # aws_lightsail_static_ip_attachment.onweek_test will be created
  + resource "aws_lightsail_static_ip_attachment" "onweek_test" {
      + id             = (known after apply)
      + instance_name  = (known after apply)
      + ip_address     = (known after apply)
      + static_ip_name = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + windows_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pusher: @stevewritescode, Action: `pull_request`*